import { Position } from './position'

export interface GameData {
  name: string
  map: number[][]
  keeper: Position
  cargos: Position[]
}

export const gameDatas: GameData[] = [
  {
    name: '关卡一',
    map: [
      [0, 0, 1, 1, 1, 1, 1, 0],
      [1, 1, 1, 2, 2, 2, 1, 0],
      [1, 2, 2, 2, 2, 2, 1, 0],
      [1, 1, 1, 3, 2, 2, 1, 0],
      [1, 2, 1, 1, 2, 2, 1, 0],
      [1, 2, 1, 2, 2, 2, 1, 1],
      [1, 2, 2, 2, 2, 2, 2, 1],
      [1, 2, 2, 2, 2, 2, 2, 1],
      [1, 1, 1, 1, 1, 1, 1, 1]
    ],
    keeper: {
      x: 3,
      y: 1
    },
    cargos: [{ x: 3, y: 2 }]
  },
  {
    name: '关卡二',
    map: [
      [1, 1, 1, 1, 1, 1, 1, 1],
      [1, 2, 2, 2, 2, 2, 2, 1],
      [1, 2, 2, 2, 2, 2, 2, 1],
      [1, 2, 2, 2, 2, 2, 2, 1],
      [1, 2, 2, 1, 2, 2, 2, 1],
      [1, 2, 2, 2, 2, 3, 2, 1],
      [1, 2, 2, 2, 2, 2, 2, 1],
      [1, 2, 2, 2, 2, 2, 2, 1],
      [1, 1, 1, 1, 1, 1, 1, 1]
    ],
    keeper: {
      x: 3,
      y: 1
    },
    cargos: [{ x: 3, y: 2 }]
  }
]
